---
kind: property
id: P:Autodesk.Revit.DB.SymbolTypeId.Newton
source: html/b26cb343-be07-0253-1861-e4aa99f282a6.htm
---
# Autodesk.Revit.DB.SymbolTypeId.Newton Property

Symbol N, indicating unit Newtons.

## Syntax (C#)
```csharp
public static ForgeTypeId Newton { get; }
```